Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОП/ДанныеВебКабинетаСУО_ОП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ОП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОП/ManagerModule.bsl
Процедура ДобавитьДанные(Дата, Тип, Объект, Данные, Формат) Экспорт
	
	
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУО_ОП.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Отбор.Тип.Установить(Тип);
	НаборЗаписей.Отбор.Объект.Установить(Объект);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Дата;
	НоваяЗапись.Тип = Тип;
	НоваяЗапись.Объект = Объект;
	
	НоваяЗапись.Данные = Новый ХранилищеЗначения(Данные);
	НоваяЗапись.Формат = Формат;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();	

	
КонецПроцедуры

Процедура УдалитьДанные(Объект, Тип=Неопределено) Экспорт	
		
	НаборЗаписей = РегистрыСведений.ДанныеВебКабинетаСУО_ОП.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	Если Тип <> Неопределено Тогда
		НаборЗаписей.Отбор.Тип.Установить(Тип);	
	КонецЕсли;	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
